# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с
# повторениями). Выдать без повторений в порядке возрастания все те числа, которые
# встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
# элементов второго множества. Затем пользователь вводит сами элементы множеств.

# Input:
# 11 6
# 2 4 6 8 10 12 10 8 6 4 2
# 3 6 9 12 15 18
# Output:
# 6 12

n = int(input('Введите количество элементов первого множества '))
set1 = set()
for i in range(n):
    set1.add(input())
    m = int(input('Введите количество элементов второго множества '))
set2 = set()
for i in range(m):
    set2.add(input())
output_set = sorted(set1 & set2, key = int)
print(output_set)


# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.

# Input:
# 4 -> 1 2 3 4
# Output:
# 9

berries = input()
list1 = list(map(int, berries.split()))
sum = [ list1[i - 1] + list1[i] + list1[(i + 1) % len(list1)] for i in range(len(list1)) ]
print(max(sum))